tap 'homebrew/bundle'

brew 'openssl'
brew 'node'
brew 'curl'
brew 'ruby-build'
brew 'go'
brew 'postgresql'
brew 'redis'
brew 'vim'
brew 'git'
brew 'zsh'
brew 'docker'
brew 'jq'
brew 'erlang'
brew 'elixir'
brew 'tmux'
brew 'tree'
brew 'python3'
brew 'pgcli'
brew 'ag'
brew 'fzf'
brew 'rbenv'
brew 'tmate'
brew 'htop'

cask_args appdir: '/Applications'
tap 'caskroom/cask'

cask 'java'
cask 'google-chrome'
cask 'slack'
cask 'docker'
cask 'flux'
cask 'telegram'
cask 'transmission'
cask 'vlc'
cask 'steam'
cask 'dashlane'
cask 'spotify'

brew 'scala'
