cask_args appdir: '/Applications'

tap 'caskroom/cask'
tap 'caskroom/fonts'
tap 'caskroom/versions'
tap 'homebrew/bundle'
tap 'homebrew/core'

cask 'font-hack-nerd-font'
cask 'firefox'
cask 'slack'
cask 'spotify'
cask 'sublime-text'
cask 'dashlane'
cask 'docker'
cask 'java8' # required for bazel

brew 'ack'
brew 'ag'
brew 'autoconf'
brew 'automake'
brew 'bazel'
brew 'coreutils'
brew 'crystal-lang'
brew 'ctop'
brew 'curl'
brew 'docker'
brew 'elixir'
brew 'erlang'
brew 'fzf'
brew 'git'
brew 'go'
brew 'heroku'
brew 'htop'
brew 'imagemagick'
brew 'jq'
brew 'kubectl'
brew 'kubectx'
brew 'kubernetes-helm'
brew 'libtool'
brew 'libyaml'
brew 'mysql'
brew 'nvm'
brew 'openssl'
brew 'packer'
brew 'perl'
brew 'pgcli'
brew 'pgcli'
brew 'phrase/brewed/phraseapp'
brew 'pinentry-mac'
brew 'postgresql'
brew 'python3'
brew 'rbenv'
brew 'reattach-to-user-namespace'
brew 'redis'
brew 'ruby-build'
brew 'rust'
brew 'sqlite'
brew 'telnet'
brew 'terraform'
brew 'tmux'
brew 'vim'
brew 'watch'
brew 'wget'
brew 'yarn'
brew 'zsh'
brew 'zsh-autosuggestions'
