cask_args appdir: '/Applications'

tap 'caskroom/cask'
tap 'caskroom/fonts'
tap 'homebrew/bundle'
tap 'homebrew/core'
tap 'homebrew/versions'
tap 'phrase/brewed'

cask 'evernote'
cask 'flux'
cask 'font-hack-nerd-font'
cask 'google-chrome'
cask 'java'
cask 'qutebrowser'
cask 'slack'
cask 'spotify'
cask 'steam'
cask 'steam'
cask 'sublime-text'
cask 'transmission'
cask 'vlc'

brew 'ack'
brew 'ag'
brew 'autoconf'
brew 'automake'
brew 'coreutils'
brew 'crystal-lang'
brew 'ctop'
brew 'curl'
brew 'docker'
brew 'elixir'
brew 'erlang'
brew 'fzf'
brew 'git'
brew 'go'
brew 'gpg'
brew 'heroku'
brew 'htop'
brew 'hub'
brew 'imagemagick'
brew 'jq'
brew 'libtool'
brew 'libyaml'
brew 'mysql'
brew 'node'
brew 'nvm'
brew 'openssl'
brew 'perl'
brew 'pgcli'
brew 'pgcli'
brew 'phrase/brewed/phraseapp'
brew 'postgresql'
brew 'python3'
brew 'rbenv'
brew 'reattach-to-user-namespace'
brew 'redis'
brew 'ruby'
brew 'ruby-build'
brew 'rust'
brew 'sbt'
brew 'scala'
brew 'sqlite'
brew 'tmate'
brew 'tmux'
brew 'tree'
brew 'unrar'
brew 'vim'
brew 'wget'
brew 'yarn'
brew 'zsh'

brew 'qt@5.5', link: :force, overwrite: true
# --overwrite: overwrite any Qt4 files that might be there
# --force: required because Qt is keg-only
# `brew link --overwrite --force qt@5.5`
